app/controllers/users_controller.rb

  def new
    if logged_in?
      flash[:info] = "You are already logged in."
      redirect_to user_path(current_user)
    end

    @user = User.new
    @plans = Plan.all
---
SELECT "plans".* FROM "plans"

  def create
    @user = User.new(user_params)
    @plans = Plan.all

    if @user.save
---
SELECT  "plans".* FROM "plans" ORDER BY "plans"."id" ASC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest", "role", "activation_digest", "username", "stripe_customer_id", "plan") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)